# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "bat"
brew "exa"
brew "git"
brew "httpie"
brew "mas"
brew "nano"
brew "spaceship"
brew "speedtest-cli"
brew "tldr"

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------

# Fonts
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-jetbrains-mono"
cask "font-roboto"
cask "font-roboto-flex"
cask "font-roboto-mono"

# Development
cask "1password-cli"
cask "iterm2"
cask "phpstorm"
cask "visual-studio-code"
cask "webstorm"

# Desktop applications
cask "1password"
cask "alfred"
cask "dropbox"
cask "figma"
cask "google-chrome"
cask "obsidian"

# ------------------------------------------------------------------------------
# App Store applications
# ------------------------------------------------------------------------------
mas "Amphetamine", id: 937984704