tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "roots/tap"
brew "libpng"
brew "gmp"
brew "openssl@3"
brew "unixodbc"
brew "asdf"
brew "bat"
brew "bison"
brew "exa"
brew "gawk"
brew "gh"
brew "git"
brew "gnupg"
brew "httpie"
brew "icu4c"
brew "imagemagick"
brew "libiconv"
brew "libpq"
brew "libsodium"
brew "libzip"
brew "lima"
brew "mas"
brew "nano"
brew "oniguruma"
brew "pkg-config"
brew "re2c"
brew "spaceship"
brew "speedtest-cli"
brew "tldr"
brew "wp-cli"
brew "z"
brew "roots/tap/trellis-cli"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "bartender"
cask "dropbox"
cask "fig"
cask "figma"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-for-powerline"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-jetbrains-mono"
cask "font-roboto"
cask "font-roboto-flex"
cask "font-roboto-mono"
cask "github"
cask "google-chrome"
cask "hashicorp-vagrant"
cask "hyper"
cask "iterm2"
cask "obsidian"
cask "phpstorm"
cask "spark"
cask "vagrant"
cask "visual-studio-code"
cask "webstorm"
mas "Amphetamine", id: 937984704
